# ViewAnalysisResultsVisibility Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewAnalysisResultsVisibility Property
ParameterTypeId Class See Also
---
"Analysis Display Settings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewAnalysisResultsVisibility { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewAnalysisResultsVisibility As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewAnalysisResultsVisibility {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace